// Написать программу, в которую пользователь вводит два ЦЕЛЫХ числа
// И ПОЛУЧАЕТ частное введенных чисел.

double numberA = 12;
double numberB = 5;
Console.WriteLine(numberA/numberB);



