// Написать программу, в которую пользователь вводит два ЦЕЛЫХ числа
// И ПОЛУЧАЕТ частное введенных чисел.

int numberA = 10;
int numberB = 5;
Console.Writeline(numberA/numberB);

