// 
// Задача 44: Не используя рекурсию, выведите первые N чисел Фибоначчи. 
// Первые два числа Фибоначчи: 0 и 1.

// Если N = 5 -> 0 1 1 2 3
// Если N = 3 -> 0 1 1
// Если N = 7 -> 0 1 1 2 3 5 8


int Fibonacci (int n)
{
int chislo=0;
for (int i=0; i< 15; i++)
{
   
    { 
    chislo = 0
    Console.WriteLine()
    }

}