// Задача 13: 
// Напишите программу, которая выводит третью цифру заданного числа или сообщает, 
// что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

bool FirstCompare (int numb)
if (numb < 100)
{
    Console.WriteLine ($"There is no third number in {numb}");
    return false;
}
else
{
    return true;
}

void SecondCompare (int numb)
if 









System.Console.WriteLine ($"ВВЕДИТЕ ЧИСЛО--->   ");
int number =Convert.ToInt32(Console.ReadLine());
print ThirdElement(number);



