// Написать программу на зыке С# в которую пользователь вводит два числа,
//  (эти два числа генерируются случайным образом)
// и после этого выводит на экран сумму этих двух чисел

int numberA = 3;
int numberB = 5;
Console.WriteLine (numberA + numberB);


